linux/tutorials/org/20091152888/20091152888.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2021-06-22 Tue 13:35 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>《操作系统原理》实验报告</title>
<meta name="generator" content="Org mode">
<meta name="author" content="王晓林(20091152888)">
<link rel="stylesheet" href="https://cs6.swfu.edu.cn/org.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">《操作系统原理》实验报告</h1>
<p>
Now, let me show you some Org-mode tricks.
</p>

<div id="outline-container-org228b0fd" class="outline-2">
<h2 id="org228b0fd"><span class="section-number-2">1.</span> This is a section</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>this is a numbered list</li>
<li>type M-return to add a new numbered line</li>
<li>ok, type C-j to
<ul class="org-ul">
<li>see? C-j is better than RETURN</li>
<li>type M-return to add a new un-numbered line</li>
<li>To move this line left, type M-leftarrow</li>
</ul></li>
<li><p>
To move this line right, type M-rightarrow
</p>
<pre class="example">
this is a special line, begin with ':'
</pre></li>
<li>if you have a lot of special lines, you can do like this</li>
</ol>
<pre class="example" id="orgfac70ff">
this is a special line
this is another
more...
</pre>
</div>
<div id="outline-container-org9794cd3" class="outline-3">
<h3 id="org9794cd3"><span class="section-number-3">1.1.</span> This is a subsection</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>if you want to insert some source code, you can do like this</li>
</ul>
<p>
#+include "~/git/lecture_notes/os/src/tiny.c" src c -n
</p>
<ul class="org-ul">
<li>Now let's export a HTML file</li>
<li>See? Org-mode is easy. You just need more practice</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 王晓林(20091152888)</p>
<p class="date">Created: 2021-06-22 Tue 13:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
